Repository: mishrafabric/cmux
Catalog: webviews/src/pages/diff/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, vi, zh_hans, zh_hant

# diffViewer.expandFile
source: Expand {file}
ar: توسيع {file}
bs: Proširi {file}
da: Fold {file} ud
de: {file} ausklappen
es: Expandir {file}
fr: Développer {file}
it: Espandi {file}
ja: {file} を展開
km: ពង្រីក {file}
ko: {file} 펼치기
nb: Utvid {file}
pl: Rozwiń {file}
pt_br: Expandir {file}
ru: Развернуть {file}
th: ขยาย {file}
tr: {file} genişlet
uk: Розгорнути {file}
vi: Mở rộng {file}
zh_hans: 展开 {file}
zh_hant: 展開 {file}

# diffViewer.expandUnchangedContext
source: Expand unchanged context
ar: توسيع السياق غير المعدل
bs: Proširi nepromijenjeni kontekst
da: Fold uændret kontekst ud
de: Unveränderten Kontext erweitern
es: Expandir contexto sin cambios
fr: Développer le contexte inchangé
it: Espandi contesto invariato
ja: 変更のない行を展開
km: ពង្រីកបរិបទដែលមិនផ្លាស់ប្ដូរ
ko: 변경되지 않은 컨텍스트 펼치기
nb: Utvid uendret kontekst
pl: Rozwiń niezmieniony kontekst
pt_br: Expandir contexto inalterado
ru: Развернуть неизменённый контекст
th: ขยายบริบทที่ไม่เปลี่ยนแปลง
tr: Değişmeyen bağlamı genişlet
uk: Розгорнути незмінений контекст
vi: Mở rộng ngữ cảnh không thay đổi
zh_hans: 展开未更改的上下文
zh_hant: 展開未變更的內容

# diffViewer.fileActions
source: More actions for {file}
ar: إجراءات إضافية لـ {file}
bs: Više radnji za {file}
da: Flere handlinger for {file}
de: Weitere Aktionen für {file}
es: Más acciones para {file}
fr: Plus d’actions pour {file}
it: Altre azioni per {file}
ja: {file} のその他の操作
km: សកម្មភាពបន្ថែមសម្រាប់ {file}
ko: {file} 추가 작업
nb: Flere handlinger for {file}
pl: Więcej działań dla {file}
pt_br: Mais ações para {file}
ru: Другие действия для {file}
th: การดำเนินการเพิ่มเติมสำหรับ {file}
tr: {file} için diğer işlemler
uk: Інші дії для {file}
vi: Thao tác khác cho {file}
zh_hans: {file} 的更多操作
zh_hant: {file} 的更多操作

# diffViewer.files
source: Files
ar: ملفات
bs: Nastavak: Files
da: Fortsæt: Files
de: Dateien
es: Archivos
fr: Fichiers
it: Continua: Files
ja: ファイル
km: បន្ត៖ Files
ko: 파일
nb: Fortsett: Files
pl: Kontynuuj: Files
pt_br: Continuar: Files
ru: Продолжить: Files
th: ดำเนินการต่อ: Files
tr: Devam: Files
uk: Продовжити: Files
vi: Tệp
zh_hans: 文件
zh_hant: 文件

# diffViewer.filesViewedProgress
source: {viewed} of {total} files viewed
ar: تمت مشاهدة {viewed} من {total} ملفات
bs: Pregledano {viewed} od {total} datoteka
da: {viewed} af {total} filer set
de: {viewed} von {total} Dateien angesehen
es: {viewed} de {total} archivos vistos
fr: {viewed} fichiers sur {total} vus
it: {viewed} file visti su {total}
ja: {total} 件中 {viewed} 件を確認済み
km: បានមើល {viewed} ក្នុងចំណោម {total} ឯកសារ
ko: {total}개 중 {viewed}개 파일 확인함
nb: {viewed} av {total} filer sett
pl: Obejrzano plików: {viewed} z {total}
pt_br: {viewed} de {total} arquivos vistos
ru: Просмотрено файлов: {viewed} из {total}
th: ดูแล้ว {viewed} จาก {total} ไฟล์
tr: {total} dosyadan {viewed} tanesi görüldü
uk: Переглянуто файлів: {viewed} з {total}
vi: Đã xem {viewed}/{total} tệp
zh_hans: 已查看 {viewed}/{total} 个文件
zh_hant: 已檢視 {viewed}/{total} 個檔案

# diffViewer.filterAddedFiles
source: Added
ar: مضافة
bs: Dodano
da: Tilføjet
de: Hinzugefügt
es: Añadidos
fr: Ajoutés
it: Aggiunti
ja: 追加
km: បានបន្ថែម
ko: 추가됨
nb: Lagt til
pl: Dodane
pt_br: Adicionados
ru: Добавленные
th: เพิ่มแล้ว
tr: Eklenen
uk: Додані
vi: Đã thêm
zh_hans: 新增
zh_hant: 新增

# diffViewer.filterDeletedFiles
source: Deleted
ar: محذوفة
bs: Izbrisano
da: Slettet
de: Gelöscht
es: Eliminados
fr: Supprimés
it: Eliminati
ja: 削除
km: បានលុប
ko: 삭제됨
nb: Slettet
pl: Usunięte
pt_br: Excluídos
ru: Удалённые
th: ลบแล้ว
tr: Silinen
uk: Видалені
vi: Đã xóa
zh_hans: 已删除
zh_hant: 已刪除

# diffViewer.filterFiles
source: Filter files…
ar: تصفية الملفات
bs: Filtriraj datoteke
da: Filtrér filer
de: Dateien filtern
es: Filtrar archivos
fr: Filtrer les fichiers
it: Filtra i file
ja: ファイルを絞り込む…
km: ត្រងឯកសារ
ko: 파일 필터
nb: Filtrer filer
pl: Filtruj pliki
pt_br: Filtrar arquivos
ru: Фильтр файлов
th: กรองไฟล์
tr: Dosyaları filtrele
uk: Фільтрувати файли
vi: Lọc tệp
zh_hans: 筛选文件
zh_hant: 篩選檔案

# diffViewer.filterModifiedFiles
source: Modified
ar: معدّلة
bs: Izmijenjeno
da: Ændret
de: Geändert
es: Modificados
fr: Modifiés
it: Modificati
ja: 変更
km: បានកែប្រែ
ko: 수정됨
nb: Endret
pl: Zmodyfikowane
pt_br: Modificados
ru: Изменённые
th: แก้ไขแล้ว
tr: Değiştirilen
uk: Змінені
vi: Đã sửa đổi
zh_hans: 已修改
zh_hant: 已修改

# diffViewer.filterRenamedFiles
source: Renamed
ar: معاد تسميتها
bs: Preimenovano
da: Omdøbt
de: Umbenannt
es: Renombrados
fr: Renommés
it: Rinominati
ja: 名前変更
km: បានប្ដូរឈ្មោះ
ko: 이름 변경됨
nb: Omdøpt
pl: Zmieniona nazwa
pt_br: Renomeados
ru: Переименованные
th: เปลี่ยนชื่อแล้ว
tr: Yeniden adlandırılan
uk: Перейменовані
vi: Đã đổi tên
zh_hans: 已重命名
zh_hant: 已重新命名

# diffViewer.findClose
source: Close find
ar: إغلاق البحث
bs: Zatvori pretragu
da: Luk søgning
de: Suche schließen
es: Cerrar búsqueda
fr: Fermer la recherche
it: Chiudi ricerca
ja: 検索を閉じる
km: បិទការស្វែងរក
ko: 찾기 닫기
nb: Lukk søk
pl: Zamknij wyszukiwanie
pt_br: Fechar busca
ru: Закрыть поиск
th: ปิดการค้นหา
tr: Aramayı kapat
uk: Закрити пошук
vi: Đóng tìm kiếm
zh_hans: 关闭查找
zh_hant: 關閉尋找

# diffViewer.findInDiff
source: Find in diff
ar: البحث في الفروقات
bs: Pronađi u razlikama
da: Søg i forskelle
de: In Diff suchen
es: Buscar en las diferencias
fr: Rechercher dans le diff
it: Cerca nelle differenze
ja: 差分内を検索
km: ស្វែងរកក្នុងភាពខុសគ្នា
ko: 변경 사항에서 찾기
nb: Søk i forskjeller
pl: Znajdź w różnicach
pt_br: Buscar nas diferenças
ru: Найти в различиях
th: ค้นหาในความแตกต่าง
tr: Farklarda bul
uk: Знайти у відмінностях
vi: Tìm trong diff
zh_hans: 在 diff 中查找
zh_hant: 在差異中尋找

# diffViewer.findNextMatch
source: Next match
ar: المباراة القادمة
bs: Sljedeće podudaranje
da: Næste forekomst
de: Nächstes Spiel
es: Próximo partido
fr: Prochain match
it: Corrispondenza successiva
ja: 次の一致
km: លទ្ធផលបន្ទាប់
ko: 다음 경기
nb: Neste treff
pl: Następne dopasowanie
pt_br: Próxima ocorrência
ru: Следующее совпадение
th: ผลลัพธ์ถัดไป
tr: Sonraki eşleşme
uk: Наступний збіг
vi: Kết quả tiếp theo
zh_hans: 下一个匹配项
zh_hant: 下一場比賽

# diffViewer.findPreviousMatch
source: Previous match
ar: المباراة السابقة
bs: Prethodno podudaranje
da: Forrige forekomst
de: Vorheriges Spiel
es: Partido anterior
fr: Match précédent
it: Corrispondenza precedente
ja: 前の一致
km: លទ្ធផលមុន
ko: 이전 경기
nb: Forrige treff
pl: Poprzednie dopasowanie
pt_br: Ocorrência anterior
ru: Предыдущее совпадение
th: ผลลัพธ์ก่อนหน้า
tr: Önceki eşleşme
uk: Попередній збіг
vi: Kết quả trước
zh_hans: 上一个匹配项
zh_hant: 上一場比賽

# diffViewer.generatedFile
source: Generated file
ar: ملف مُولَّد
bs: Generisana datoteka
da: Genereret fil
de: Generierte Datei
es: Archivo generado
fr: Fichier généré
it: File generato
ja: 生成ファイル
km: ឯកសារដែលបានបង្កើតដោយស្វ័យប្រវត្តិ
ko: 생성된 파일
nb: Generert fil
pl: Plik wygenerowany
pt_br: Arquivo gerado
ru: Сгенерированный файл
th: ไฟล์ที่สร้างขึ้นอัตโนมัติ
tr: Oluşturulmuş dosya
uk: Згенерований файл
vi: Tệp được tạo tự động
zh_hans: 生成的文件
zh_hant: 產生的檔案

# diffViewer.hideBackgrounds
source: Hide backgrounds
ar: إخفاء الخلفيات
bs: Sakrij pozadine
da: Skjul baggrunde
de: Hintergründe ausblenden
es: Ocultar fondos
fr: Masquer les arrière-plans
it: Nascondi sfondi
ja: 背景色を隠す
km: លាក់ផ្ទៃខាងក្រោយ
ko: 배경 숨기기
nb: Skjul bakgrunner
pl: Ukryj tła
pt_br: Ocultar fundos
ru: Скрыть фон
th: ซ่อนพื้นหลัง
tr: Arka planları gizle
uk: Приховати тло
vi: Ẩn nền
zh_hans: 隐藏背景
zh_hant: 隱藏背景

# diffViewer.hideFileSearch
source: Hide file search
ar: إخفاء بحث الملفات
bs: Sakrij pretragu datoteka
da: Skjul filsøgning
de: Dateisuche ausblenden
es: Ocultar búsqueda de archivos
fr: Masquer la recherche de fichiers
it: Nascondi ricerca file
ja: ファイル検索を隠す
km: លាក់ការស្វែងរកឯកសារ
ko: 파일 검색 숨기기
nb: Skjul filsøk
pl: Ukryj wyszukiwanie plików
pt_br: Ocultar busca de arquivos
ru: Скрыть поиск файлов
th: ซ่อนการค้นหาไฟล์
tr: Dosya aramasını gizle
uk: Приховати пошук файлів
vi: Ẩn tìm kiếm tệp
zh_hans: 隐藏文件搜索
zh_hant: 隱藏檔案搜尋

# diffViewer.hideFiles
source: Hide files
ar: إخفاء الملفات
bs: Sakrij datoteke
da: Skjul filer
de: Dateien ausblenden
es: Ocultar archivos
fr: Masquer les fichiers
it: Nascondi file
ja: ファイルを隠す
km: លាក់ឯកសារ
ko: 파일 숨기기
nb: Skjul filer
pl: Ukryj pliki
pt_br: Ocultar arquivos
ru: Скрыть файлы
th: ซ่อนไฟล์
tr: Dosyaları gizle
uk: Приховати файли
vi: Ẩn tệp
zh_hans: 隐藏文件
zh_hant: 隱藏檔案

# diffViewer.hideImports
source: Hide imports
ar: إخفاء الاستيرادات
bs: Sakrij uvoze
da: Skjul importer
de: Importe ausblenden
es: Ocultar importaciones
fr: Masquer les imports
it: Nascondi importazioni
ja: インポートを隠す
km: លាក់ការនាំចូល
ko: 가져오기 숨기기
nb: Skjul importer
pl: Ukryj importy
pt_br: Ocultar importações
ru: Скрыть импорты
th: ซ่อนการนำเข้า
tr: İçe aktarmaları gizle
uk: Приховати імпорти
vi: Ẩn lệnh nhập
zh_hans: 隐藏导入
zh_hant: 隱藏匯入

# diffViewer.hideLineNumbers
source: Hide line numbers
ar: إخفاء أرقام الأسطر
bs: Sakrij brojeve redova
da: Skjul linjenumre
de: Zeilennummern ausblenden
es: Ocultar números de línea
fr: Masquer les numéros de ligne
it: Nascondi numeri di riga
ja: 行番号を隠す
km: លាក់លេខបន្ទាត់
ko: 줄 번호 숨기기
nb: Skjul linjenumre
pl: Ukryj numery wierszy
pt_br: Ocultar números de linha
ru: Скрыть номера строк
th: ซ่อนหมายเลขบรรทัด
tr: Satır numaralarını gizle
uk: Приховати номери рядків
vi: Ẩn số dòng
zh_hans: 隐藏行号
zh_hant: 隱藏行號

# diffViewer.hideViewedFiles
source: Hide viewed files
ar: إخفاء الملفات التي تمت مشاهدتها
bs: Sakrij pregledane datoteke
da: Skjul sete filer
de: Angesehene Dateien ausblenden
es: Ocultar archivos vistos
fr: Masquer les fichiers vus
it: Nascondi i file visti
ja: 確認済みファイルを隠す
km: លាក់ឯកសារដែលបានមើល
ko: 확인한 파일 숨기기
nb: Skjul sette filer
pl: Ukryj obejrzane pliki
pt_br: Ocultar arquivos vistos
ru: Скрыть просмотренные файлы
th: ซ่อนไฟล์ที่ดูแล้ว
tr: Görülen dosyaları gizle
uk: Сховати переглянуті файли
vi: Ẩn tệp đã xem
zh_hans: 隐藏已查看的文件
zh_hant: 隱藏已檢視的檔案

# diffViewer.hideWhitespace
source: Hide white space
ar: إخفاء المسافات البيضاء
bs: Sakrij bjeline
da: Skjul blanktegn
de: Leerraum ausblenden
es: Ocultar espacios en blanco
fr: Masquer les espaces
it: Nascondi spazi bianchi
ja: 空白の変更を隠す
km: លាក់ចន្លោះទទេ
ko: 공백 숨기기
nb: Skjul blanktegn
pl: Ukryj białe znaki
pt_br: Ocultar espaços em branco
ru: Скрыть пробельные символы
th: ซ่อนช่องว่าง
tr: Boşlukları gizle
uk: Приховати пробільні символи
vi: Ẩn khoảng trắng
zh_hans: 隐藏空白
zh_hant: 隱藏空白

# diffViewer.indicatorStyle
source: Indicator style
ar: نمط المؤشر
bs: Stil indikatora
da: Indikatorstil
de: Indikatorstil
es: Estilo de indicador
fr: Style de l’indicateur
it: Stile indicatore
ja: インジケータの形式
km: រចនាប័ទ្មសូចនាករ
ko: 표시기 스타일
nb: Indikatorstil
pl: Styl wskaźnika
pt_br: Estilo do indicador
ru: Стиль индикатора
th: รูปแบบตัวบ่งชี้
tr: Gösterge stili
uk: Стиль індикатора
vi: Kiểu chỉ báo
zh_hans: 指示器样式
zh_hant: 指標樣式

# diffViewer.jumpToFile
source: Jump to file
ar: الانتقال إلى ملف
bs: Idi na datoteku
da: Gå til fil
de: Zu Datei springen
es: Ir al archivo
fr: Aller au fichier
it: Vai al file
ja: ファイルへ移動
km: ទៅកាន់ឯកសារ
ko: 파일로 이동
nb: Gå til fil
pl: Przejdź do pliku
pt_br: Ir para arquivo
ru: Перейти к файлу
th: ไปที่ไฟล์
tr: Dosyaya git
uk: Перейти до файлу
vi: Nhảy đến tệp
zh_hans: 跳转到文件
zh_hant: 跳至檔案

# diffViewer.jumpToFileMore
source: {count} more, type to filter
ar: أكثر بـ {count}، اكتب للتصفية
bs: Još {count}, unesite tekst za filtriranje
da: {count} flere, skriv for at filtrere
de: {count} weitere, zum Filtern tippen
es: {count} más, escribe para filtrar
fr: {count} de plus, saisissez pour filtrer
it: Altri {count}, digita per filtrare
ja: ほか {count} 件。入力して絞り込み
km: {count} ទៀត វាយដើម្បីត្រង
ko: {count}개 더 있음, 필터링하려면 입력하세요
nb: {count} flere, skriv for å filtrere
pl: Jeszcze {count}, wpisz tekst, aby filtrować
pt_br: Mais {count}, digite para filtrar
ru: Ещё {count}, введите текст для фильтрации
th: อีก {count} รายการ พิมพ์เพื่อกรอง
tr: {count} tane daha, filtrelemek için yazın
uk: Ще {count}, введіть текст для фільтрування
vi: {count} mục nữa, nhập để lọc
zh_hans: 还有 {count} 项，输入以筛选
zh_hant: 還有 {count} 個，輸入以進行篩選

# diffViewer.jumpToFileNoMatches
source: No matching files
ar: لا توجد ملفات مطابقة
bs: Nema odgovarajućih datoteka
da: Ingen matchende filer
de: Keine passenden Dateien
es: Ningún archivo coincide
fr: Aucun fichier correspondant
it: Nessun file corrispondente
ja: 一致するファイルがありません
km: គ្មានឯកសារដែលត្រូវគ្នា
ko: 일치하는 파일 없음
nb: Ingen samsvarende filer
pl: Brak pasujących plików
pt_br: Nenhum arquivo correspondente
ru: Нет подходящих файлов
th: ไม่มีไฟล์ที่ตรงกัน
tr: Eşleşen dosya yok
uk: Немає відповідних файлів
vi: Không có tệp khớp
zh_hans: 没有匹配的文件
zh_hant: 沒有符合的檔案

# diffViewer.largeDiff
source: Large diff
ar: فرق كبير
bs: Veliki diff
da: Stor diff
de: Großer Diff
es: Diff grande
fr: Diff volumineux
it: Diff di grandi dimensioni
ja: 大きな差分
km: diff ធំ
ko: 큰 변경 사항
nb: Stor diff
pl: Duży diff
pt_br: Diff grande
ru: Большой diff
th: diff ขนาดใหญ่
tr: Büyük diff
uk: Великий diff
vi: Diff lớn
zh_hans: 大型差异
zh_hant: 大型差異

# diffViewer.loadDiff
source: Load diff
ar: تحميل الفرق
bs: Učitaj diff
da: Indlæs diff
de: Diff laden
es: Cargar diff
fr: Charger le diff
it: Carica diff
ja: 差分を読み込む
km: ផ្ទុក diff
ko: 변경 사항 불러오기
nb: Last inn diff
pl: Wczytaj diff
pt_br: Carregar diff
ru: Загрузить diff
th: โหลด diff
tr: Diff'i yükle
uk: Завантажити diff
vi: Tải diff
zh_hans: 加载差异
zh_hant: 載入差異

# diffViewer.loadFullFiles
source: Load full files
ar: تحميل الملفات كاملة
bs: Učitaj cijele datoteke
da: Indlæs hele filer
de: Vollständige Dateien laden
es: Cargar archivos completos
fr: Charger les fichiers complets
it: Carica file completi
ja: ファイル全体を読み込む
km: ផ្ទុកឯកសារពេញលេញ
ko: 전체 파일 불러오기
nb: Last inn hele filer
pl: Wczytaj całe pliki
pt_br: Carregar arquivos completos
ru: Загрузить файлы целиком
th: โหลดไฟล์ทั้งหมด
tr: Dosyaların tamamını yükle
uk: Завантажити файли повністю
vi: Tải toàn bộ tệp
zh_hans: 加载完整文件
zh_hant: 載入完整檔案

# diffViewer.loadingDiff
source: Loading diff...
ar: جاري تحميل الفروقات...
bs: Učitavanje razlika...
da: Indlæser forskelle...
de: Diff wird geladen...
es: Cargando diferencias...
fr: Chargement du diff...
it: Caricamento delle differenze...
ja: 差分を読み込み中...
km: កំពុងផ្ទុកភាពខុសគ្នា...
ko: 변경 사항 불러오는 중...
nb: Laster inn forskjeller...
pl: Wczytywanie różnic...
pt_br: Carregando diferenças...
ru: Загрузка различий...
th: กำลังโหลดความแตกต่าง...
tr: Farklar yükleniyor...
uk: Завантаження відмінностей...
vi: Đang tải diff...
zh_hans: 正在加载差异...
zh_hant: 正在載入差異...

# diffViewer.loadingRenderer
source: Loading renderer...
ar: جاري تحميل أداة العرض...
bs: Učitavanje prikazivača...
da: Indlæser renderer...
de: Renderer wird geladen...
es: Cargando renderizador...
fr: Chargement du moteur de rendu...
it: Caricamento del renderer...
ja: レンダラを読み込み中...
km: កំពុងផ្ទុកកម្មវិធីបង្ហាញ...
ko: 렌더러 불러오는 중...
nb: Laster inn renderer...
pl: Wczytywanie modułu renderowania...
pt_br: Carregando renderizador...
ru: Загрузка средства отображения...
th: กำลังโหลดตัวแสดงผล...
tr: İşleyici yükleniyor...
uk: Завантаження засобу відображення...
vi: Đang tải renderer...
zh_hans: 正在加载渲染器...
zh_hant: 正在載入轉譯器...

# diffViewer.markNotViewed
source: Mark as not viewed
ar: إزالة علامة تمت المشاهدة
bs: Označi kao nepregledano
da: Markér som ikke set
de: Als nicht angesehen markieren
es: Marcar como no visto
fr: Marquer comme non vu
it: Segna come non visto
ja: 未確認にする
km: សម្គាល់ថាមិនទាន់បានមើល
ko: 확인 안 함으로 표시
nb: Merk som ikke sett
pl: Oznacz jako nieobejrzane
pt_br: Marcar como não visto
ru: Отметить как непросмотренное
th: ทำเครื่องหมายว่ายังไม่ได้ดู
tr: Görülmedi olarak işaretle
uk: Позначити як непереглянуте
vi: Đánh dấu chưa xem
zh_hans: 标记为未查看
zh_hant: 標記為未檢視

# diffViewer.markViewed
source: Mark as viewed
ar: وضع علامة تمت المشاهدة
bs: Označi kao pregledano
da: Markér som set
de: Als angesehen markieren
es: Marcar como visto
fr: Marquer comme vu
it: Segna come visto
ja: 確認済みにする
km: សម្គាល់ថាបានមើល
ko: 확인함으로 표시
nb: Merk som sett
pl: Oznacz jako obejrzane
pt_br: Marcar como visto
ru: Отметить как просмотренное
th: ทำเครื่องหมายว่าดูแล้ว
tr: Görüldü olarak işaretle
uk: Позначити як переглянуте
vi: Đánh dấu đã xem
zh_hans: 标记为已查看
zh_hant: 標記為已檢視

# diffViewer.modeChange
source: Mode {old} → {new}
ar: الوضع {old} → {new}
bs: Način {old} → {new}
da: Tilstand {old} → {new}
de: Modus {old} → {new}
es: Modo {old} → {new}
it: Modalità {old} → {new}
ja: モード {old} → {new}
km: របៀប {old} → {new}
ko: 모드 {old} → {new}
nb: Modus {old} → {new}
pl: Tryb {old} → {new}
pt_br: Modo {old} → {new}
ru: Режим {old} → {new}
th: โหมด {old} → {new}
tr: Mod {old} → {new}
uk: Режим {old} → {new}
vi: Chế độ {old} → {new}
zh_hans: 模式 {old} → {new}
zh_hant: 模式 {old} → {new}

# diffViewer.noFileDiffs
source: No file diffs found in patch input.
ar: لم يتم العثور على فروق للملفات في مدخلات الرقعة.
bs: Nema razlika datoteka u unesenoj zakrpi.
da: Ingen filforskelle fundet i patch-input.
de: Keine Datei-Diffs in Patch-Eingabe gefunden.
es: No se encontraron diferencias de archivo en la entrada del parche.
fr: Aucun diff de fichier trouvé dans le patch fourni.
it: Nessuna differenza di file trovata nella patch.
ja: パッチにファイルの差分がありません。
km: រកមិនឃើញភាពខុសគ្នាឯកសារក្នុងបំណះទេ។
ko: 패치 입력에서 파일 변경 사항을 찾을 수 없습니다.
nb: Ingen filforskjeller funnet i patch-inndata.
pl: Nie znaleziono różnic plików w łatce.
pt_br: Nenhuma diferença de arquivo encontrada no patch.
ru: В патче не найдены различия файлов.
th: ไม่พบความแตกต่างของไฟล์ในแพตช์
tr: Yama girdisinde dosya farkı bulunamadı.
uk: У патчі не знайдено відмінностей файлів.
vi: Không tìm thấy diff tệp nào trong đầu vào patch.
zh_hans: 在补丁输入中未找到文件差异。
zh_hant: 在修補檔輸入中找不到檔案差異。

# diffViewer.noFilesMatchFilter
source: No files match the filter.
ar: لا توجد ملفات مطابقة للتصفية.
bs: Nijedna datoteka ne odgovara filteru.
da: Ingen filer matcher filteret.
de: Keine Dateien entsprechen dem Filter.
es: Ningún archivo coincide con el filtro.
fr: Aucun fichier ne correspond au filtre.
it: Nessun file corrisponde al filtro.
ja: フィルタに一致するファイルがありません。
km: គ្មានឯកសារណាត្រូវនឹងតម្រងទេ។
ko: 필터와 일치하는 파일이 없습니다.
nb: Ingen filer samsvarer med filteret.
pl: Żaden plik nie pasuje do filtra.
pt_br: Nenhum arquivo corresponde ao filtro.
ru: Нет файлов, соответствующих фильтру.
th: ไม่มีไฟล์ที่ตรงกับตัวกรอง
tr: Filtreyle eşleşen dosya yok.
uk: Немає файлів, що відповідають фільтру.
vi: Không có tệp nào khớp với bộ lọc.
zh_hans: 没有符合筛选条件的文件。
zh_hant: 沒有符合篩選條件的檔案。

# diffViewer.none
source: None
ar: بلا
bs: Nema
da: Ingen
de: Keine
es: Ninguno
fr: Aucun
it: Nessuno
ja: なし
km: គ្មាន
ko: 없음
nb: Ingen
pl: Brak
pt_br: Nenhum
ru: Нет
th: ไม่มี
tr: Yok
uk: Немає
vi: Không có
zh_hans: 无
zh_hant: 無

# diffViewer.openSourceURL
source: Open source URL
ar: فتح رابط المصدر
bs: Otvori izvorni URL
da: Åbn kilde-URL
de: Quell-URL öffnen
es: Abrir URL de origen
fr: Ouvrir l’URL source
it: Apri URL sorgente
ja: ソース URL を開く
km: បើក URL ប្រភព
ko: 소스 URL 열기
nb: Åpne kilde-URL
pl: Otwórz źródłowy URL
pt_br: Abrir URL de origem
ru: Открыть URL источника
th: เปิด URL ต้นทาง
tr: Kaynak URL’yi aç
uk: Відкрити URL джерела
vi: Mở URL nguồn
zh_hans: 打开源 URL
zh_hant: 開啟來源 URL

# diffViewer.optionNeedsHostSupport
source: Not available yet: cmux does not support this option
ar: غير متاح بعد: لا يدعم cmux هذا الخيار
bs: Još nije dostupno: cmux ne podržava ovu opciju
da: Ikke tilgængelig endnu: cmux understøtter ikke denne indstilling
de: Noch nicht verfügbar: cmux unterstützt diese Option nicht
es: Aún no disponible: cmux no admite esta opción
fr: Pas encore disponible : cmux ne prend pas en charge cette option
it: Non ancora disponibile: cmux non supporta questa opzione
ja: まだ使用できません: cmux がこのオプションに対応していません
km: មិនទាន់មាន៖ cmux មិនគាំទ្រជម្រើសនេះទេ
ko: 아직 사용할 수 없음: cmux가 이 옵션을 지원하지 않습니다
nb: Ikke tilgjengelig ennå: cmux støtter ikke dette alternativet
pl: Jeszcze niedostępne: cmux nie obsługuje tej opcji
pt_br: Ainda não disponível: cmux não oferece suporte a esta opção
ru: Пока недоступно: cmux не поддерживает эту опцию
th: ยังไม่พร้อมใช้งาน: cmux ไม่รองรับตัวเลือกนี้
tr: Henüz kullanılamıyor: cmux bu seçeneği desteklemiyor
uk: Поки недоступно: cmux не підтримує цю опцію
vi: Chưa khả dụng: cmux không hỗ trợ tùy chọn này
zh_hans: 尚不可用：cmux 不支持此选项
zh_hant: 尚未提供：cmux 不支援此選項

# diffViewer.options
source: Options
ar: خيارات
bs: Opcije
da: Indstillinger
de: Optionen
es: Opciones
it: Opzioni
ja: オプション
km: ជម្រើស
ko: 옵션
nb: Alternativer
pl: Opcje
pt_br: Opções
ru: Параметры
th: ตัวเลือก
tr: Seçenekler
uk: Параметри
vi: Tùy chọn
zh_hans: 选项
zh_hant: 選項

# diffViewer.parsingDiff
source: Parsing diff...
ar: جاري تحليل الفروقات...
bs: Analiza razlika...
da: Analyserer forskelle...
de: Diff wird verarbeitet...
es: Analizando diferencias...
fr: Analyse du diff...
it: Analisi delle differenze...
ja: 差分を解析中...
km: កំពុងវិភាគភាពខុសគ្នា...
ko: 변경 사항 파싱 중...
nb: Analyserer forskjeller...
pl: Analizowanie różnic...
pt_br: Analisando diferenças...
ru: Разбор различий...
th: กำลังวิเคราะห์ความแตกต่าง...
tr: Farklar ayrıştırılıyor...
uk: Розбір відмінностей...
vi: Đang phân tích diff...
zh_hans: 正在解析差异...
zh_hant: 正在剖析差異...

# diffViewer.refresh
source: Refresh
ar: تحديث
bs: Osvježi
da: Opdater
de: Aktualisieren
es: Refrescar
fr: Rafraîchir
it: Aggiorna
ja: 更新
km: ធ្វើឱ្យថ្មី
ko: 새로고침
nb: Oppdater
pl: Odśwież
pt_br: Atualizar
ru: Обновить
th: รีเฟรช
tr: Yenile
uk: Оновити
vi: Làm mới
zh_hans: 刷新
zh_hant: 重新整理

# diffViewer.renderFailed
source: Could not render this diff. Check the patch input and try again.
ar: تعذر عرض هذه الفروقات. تحقق من مدخلات الرقعة وحاول مرة أخرى.
bs: Nije moguće prikazati ovu razliku. Provjerite zakrpu i pokušajte ponovo.
da: Kunne ikke vise denne diff. Kontrollér patch-inputtet, og prøv igen.
de: Dieses Diff konnte nicht gerendert werden. Überprüfe die Patch-Eingabe und versuche es erneut.
es: No se pudo renderizar esta diferencia. Comprueba la entrada del parche e inténtalo de nuevo.
fr: Impossible de générer le rendu de ce diff. Vérifiez le patch fourni et réessayez.
it: Impossibile visualizzare le differenze. Controlla la patch e riprova.
ja: この差分を表示できませんでした。パッチの入力を確認してもう一度お試しください。
km: មិនអាចបង្ហាញភាពខុសគ្នានេះបានទេ។ ពិនិត្យបំណះហើយព្យាយាមម្តងទៀត។
ko: 이 변경 사항을 렌더링할 수 없습니다. 패치 입력을 확인하고 다시 시도하세요.
nb: Kunne ikke vise denne diffen. Kontroller patch-inndataene og prøv igjen.
pl: Nie udało się wyświetlić różnic. Sprawdź łatkę i spróbuj ponownie.
pt_br: Não foi possível exibir as diferenças. Verifique o patch e tente novamente.
ru: Не удалось отобразить различия. Проверьте патч и повторите попытку.
th: แสดงความแตกต่างนี้ไม่ได้ ตรวจสอบแพตช์แล้วลองอีกครั้ง
tr: Bu fark görüntülenemedi. Yama girdisini kontrol edip tekrar deneyin.
uk: Не вдалося відобразити відмінності. Перевірте патч і спробуйте ще раз.
vi: Không thể render diff này. Kiểm tra đầu vào patch và thử lại.
zh_hans: 无法渲染此差异。请检查补丁输入后重试。
zh_hant: 無法轉譯此差異。請檢查修補檔輸入並重試。

# diffViewer.renderingDiff
source: Rendering diff...
ar: جاري عرض الفروقات...
bs: Prikazivanje razlika...
da: Viser forskelle...
de: Diff wird gerendert...
es: Renderizando diferencias...
fr: Rendu du diff en cours...
it: Visualizzazione delle differenze...
ja: 差分を描画中...
km: កំពុងបង្ហាញភាពខុសគ្នា...
ko: 변경 사항 렌더링 중...
nb: Viser forskjeller...
pl: Wyświetlanie różnic...
pt_br: Exibindo diferenças...
ru: Отображение различий...
th: กำลังแสดงความแตกต่าง...
tr: Farklar görüntüleniyor...
uk: Відображення відмінностей...
vi: Đang render diff...
zh_hans: 正在渲染差异...
zh_hant: 正在轉譯差異...

# diffViewer.repoPath
source: Repository path
ar: مسار المستودع
bs: Putanja repozitorija
da: Lagersti
de: Repository-Pfad
es: Ruta del repositorio
fr: Chemin du dépôt
it: Percorso del repository
ja: リポジトリのパス
km: ផ្លូវឃ្លាំង
ko: 저장소 경로
nb: Arkivbane
pl: Ścieżka repozytorium
pt_br: Caminho do repositório
ru: Путь к репозиторию
th: เส้นทางที่เก็บ
tr: Depo yolu
uk: Шлях до репозиторію
vi: Đường dẫn repository
zh_hans: 仓库路径
zh_hant: 存放庫路徑
